const where = 
{
	"김근호": "D503",
	"하미경": "D502",
	"김용태": "D409",
	"한진규": "D406",
	"김용상": "D403",
	"김형석": "D410(J405)",
	"이정현": "J406",
	"황석균": "세미나실",
	"김도은": "J308(2-8)",
	"노명지": "D301",
	"김기모": "J307(2-7)",
	"이영호": "J305(2-6)",
	"김진아": "J304(2-5)",
	"배오현": "J302",
	"이윤숙": "J301",
	"이상은": "D204(J201)",
	"조양연": "D205",
	"이우진": "J208(2-4)",
	"한종오": "J207(2-3)",
	"이종문": "J205(2-2)",
	"한우진": "J204(2-1)",
	"김규조": "J202(3-1)",
	"유왕성": "J201(3-2)",
	"김성규": "D106",
	"이해창": "J108(3-8)",
	"정기엽": "J104(3-5)",
	"임지성": "J102(3-4)",
	"김보련": "J405(1-4)",
	"신현순": "D208",
	"박병찬": "마리아홀",
	"신현순/박병찬": "D208/마리아홀"
}

const teacher = 
		{
    "독서1B": "이우진",
    "독서1C": "김성규",
    "독서1D": "이우진",
    "독서1E": "김성규",
    "독서1F": "김성규",
    "독서2A": "김성규",
    "독서2B": "이영호",
    "독서2C": "이영호",
    "독서2D": "이영호",
    "독서2F": "이영호",
    "고전읽기C": "이우진",
    "확률과통계1E": "유왕성",
    "확률과통계1F": "유왕성",
    "생활과 윤리": "송기호",
    "윤리와 사상": "이수민",
    "수학Ⅱ-1A": "김진아",
    "수학Ⅱ-1D": "김진아",
    "수학Ⅱ-1E": "김진아",
    "수학Ⅱ-1F": "김진아",
    "화학Ⅱ": "한진규",
    "수학Ⅱ-2B": "이종문",
    "수학Ⅱ-2C": "이종문",
    "수학Ⅱ-2D": "이종문",
    "수학Ⅱ-2E": "이종문",
    "생명과학Ⅰ": "이상은",
    "확률과통계1A": "김도은",
    "확률과통계1B": "김도은",
    "확률과통계1C": "김도은",
    "확률과통계1D": "김도은",
    "생명과학Ⅱ": "이상은",
    "확률과통계2A": "김규조",
    "물리학Ⅰ": "이윤숙",
    "물리학Ⅱ": "노명지",
    "화학Ⅰ": "김보련",
    "지구과학Ⅰ": "조양연",
    "영어Ⅱ-1A": "한종오",
    "영어Ⅱ-1B": "한종오",
    "영어Ⅱ-1C": "한종오",
    "영어Ⅱ-1D": "한종오",
    "경제": "김기모",
    "영어Ⅱ-2A": "이정현",
    "영어Ⅱ-2B": "이정현",
    "영어Ⅱ-2E": "이정현",
    "영어Ⅱ-2F": "이정현",
    "사회문화": "김기모",
    "영미문학읽기F": "배오현",
    "한국지리": "이해창",
    "정보과학": "김용상",
    "세계사": "한우진",
    "정치와법": "김형석",
    "한국사1": "한우진",
    "일본어Ⅰ": "황석균",
    "교육학": "배오현",
    "철학": "김용태",
    "빅데이터분석1": "김용상",
    "한국사2": "정기엽",
    "중국어Ⅰ": "임지성",
    "심리학": "김혜선",
    "국제경제": "김형석",
    "빅데이터분석2A": "하미경",
	 "빅데이터분석2B": "하미경",
    "빅데이터분석2C": "김근호",
	 "빅데이터분석2D": "김근호",
    "보건1&운동1": "신현순/박병찬",
	 "보건2&운동2": "신현순/박병찬",
			"보건1":"신현순",
			"보건2":"신현순",
			"운동1":"박병찬",
			"운동2":"박병찬",
    "ㅇ": "dㅇ"
}

const list2={
    "20101": {
        "고정명": "이름",
        "D": "한국사1",
        "B": "일본어Ⅰ",
        "C": "빅데이터분석2",
        "A": "보건1&운동1"
    },
    "20102": {
        "김민찬": "이름",
        "D": "한국사1",
        "B": "일본어Ⅰ",
        "A": "빅데이터분석2",
        "C": "보건2&운동2"
    },
    "20103": {
        "김보석": "이름",
        "D": "한국사2",
        "B": "중국어Ⅰ",
        "A": "빅데이터분석2",
        "C": "보건1&운동1"
    },
    "20104": {
        "도경수": "이름",
        "A": "한국사1",
        "B": "중국어Ⅰ",
        "D": "빅데이터분석1",
        "C": "보건2&운동2"
    },
    "20105": {
        "문현빈": "이름",
        "B": "한국사2",
        "C": "중국어Ⅰ",
        "D": "빅데이터분석1",
        "A": "보건2&운동2"
    },
    "20106": {
        "박대현": "이름",
        "A": "한국사1",
        "D": "중국어Ⅰ",
        "B": "빅데이터분석2",
        "C": "보건2&운동2"
    },
    "20107": {
        "박문수": "이름",
        "A": "한국사1",
        "C": "중국어Ⅰ",
        "D": "빅데이터분석2",
        "B": "보건2&운동2"
    },
    "20108": {
        "박민준": "이름",
        "C": "한국사1",
        "B": "중국어Ⅰ",
        "D": "국제경제",
        "A": "보건1&운동1"
    },
    "20109": {
        "박준용": "이름",
        "A": "한국사2",
        "B": "중국어Ⅰ",
        "C": "빅데이터분석1",
        "D": "보건2&운동2"
    },
    "20110": {
        "박찬응": "이름",
        "D": "한국사1",
        "C": "일본어Ⅰ",
        "A": "빅데이터분석1",
        "B": "보건2&운동2"
    },
    "20111": {
        "서정호": "이름",
        "C": "한국사1",
        "B": "중국어Ⅰ",
        "D": "빅데이터분석2",
        "A": "보건1&운동1"
    },
    "20112": {
        "송종휘": "이름",
        "D": "한국사1",
        "B": "일본어Ⅰ",
        "C": "빅데이터분석1",
        "A": "보건2&운동2"
    },
    "20113": {
        "유충근": "이름",
        "A": "한국사2",
        "B": "일본어Ⅰ",
        "C": "빅데이터분석1",
        "D": "보건2&운동2"
    },
    "20114": {
        "이우진": "이름",
        "D": "한국사1",
        "C": "중국어Ⅰ",
        "A": "빅데이터분석1",
        "B": "보건1&운동1"
    },
    "20115": {
        "이준형": "이름",
        "B": "한국사2",
        "C": "중국어Ⅰ",
        "A": "교육학",
        "D": "보건1&운동1"
    },
    "20116": {
        "임창대": "이름",
        "D": "한국사2",
        "A": "일본어Ⅰ",
        "B": "빅데이터분석1",
        "C": "보건2&운동2"
    },
    "20117": {
        "조태상": "이름",
        "A": "한국사2",
        "C": "중국어Ⅰ",
        "D": "빅데이터분석1",
        "B": "보건1&운동1"
    },
    "20118": {
        "최시형": "이름",
        "B": "한국사1",
        "D": "중국어Ⅰ",
        "C": "빅데이터분석1",
        "A": "보건1&운동1"
    },
    "20119": {
        "최진혁": "이름",
        "B": "한국사2",
        "A": "일본어Ⅰ",
        "D": "빅데이터분석2",
        "C": "보건2&운동2"
    },
    "20120": {
        "최현준": "이름",
        "D": "한국사2",
        "A": "중국어Ⅰ",
        "C": "철학",
        "B": "보건2&운동2"
    },
    "20201": {
        "김도현": "이름",
        "C": "한국사2",
        "A": "일본어Ⅰ",
        "D": "빅데이터분석2",
        "B": "보건1&운동1"
    },
    "20202": {
        "김서진": "이름",
        "B": "한국사2",
        "C": "일본어Ⅰ",
        "A": "빅데이터분석1",
        "D": "보건1&운동1"
    },
    "20203": {
        "김지석": "이름",
        "B": "한국사2",
        "C": "중국어Ⅰ",
        "A": "빅데이터분석1",
        "D": "보건2&운동2"
    },
    "20205": {
        "김태훈": "이름",
        "B": "한국사1",
        "A": "일본어Ⅰ",
        "D": "빅데이터분석2",
        "C": "보건2&운동2"
    },
    "20206": {
        "박규용": "이름",
        "C": "한국사1",
        "D": "일본어Ⅰ",
        "A": "교육학",
        "B": "보건2&운동2"
    },
    "20207": {
        "박선욱": "이름",
        "A": "한국사1",
        "D": "일본어Ⅰ",
        "B": "빅데이터분석2",
        "C": "보건1&운동1"
    },
    "20208": {
        "박정호": "이름",
        "C": "한국사2",
        "A": "중국어Ⅰ",
        "D": "국제경제",
        "B": "보건1&운동1"
    },
    "20209": {
        "우상범": "이름",
        "B": "한국사1",
        "C": "중국어Ⅰ",
        "D": "국제경제",
        "A": "보건1&운동1"
    },
    "20210": {
        "윤상원": "이름",
        "B": "한국사1",
        "A": "중국어Ⅰ",
        "C": "철학",
        "D": "보건2&운동2"
    },
    "20211": {
        "이강선": "이름",
        "B": "한국사1",
        "D": "중국어Ⅰ",
        "A": "빅데이터분석2",
        "C": "보건1&운동1"
    },
    "20212": {
        "이도근": "이름",
        "A": "한국사2",
        "D": "일본어Ⅰ",
        "C": "빅데이터분석1",
        "B": "보건1&운동1"
    },
    "20213": {
        "임원호": "이름",
        "C": "한국사1",
        "B": "일본어Ⅰ",
        "A": "빅데이터분석1",
        "D": "보건2&운동2"
    },
    "20214": {
        "장정호": "이름",
        "A": "한국사1",
        "D": "일본어Ⅰ",
        "C": "빅데이터분석1",
        "B": "보건2&운동2"
    },
    "20215": {
        "전한결": "이름",
        "A": "한국사1",
        "D": "일본어Ⅰ",
        "B": "빅데이터분석1",
        "C": "보건2&운동2"
    },
    "20216": {
        "최현서": "이름",
        "A": "한국사2",
        "D": "일본어Ⅰ",
        "C": "철학",
        "B": "보건2&운동2"
    },
    "20217": {
        "태현준": "이름",
        "C": "한국사2",
        "B": "중국어Ⅰ",
        "A": "빅데이터분석2",
        "D": "보건2&운동2"
    },
    "20218": {
        "한결": "이름",
        "B": "한국사1",
        "C": "중국어Ⅰ",
        "A": "빅데이터분석2",
        "D": "보건1&운동1"
    },
    "20219": {
        "한동현": "이름",
        "C": "한국사1",
        "A": "일본어Ⅰ",
        "D": "국제경제",
        "B": "보건1&운동1"
    },
    "20220": {
        "한재윤": "이름",
        "C": "한국사1",
        "A": "중국어Ⅰ",
        "B": "심리학",
        "D": "보건1&운동1"
    },
    "20301": {
        "강준영": "이름",
        "C": "한국사1",
        "B": "일본어Ⅰ",
        "A": "빅데이터분석2",
        "D": "보건2&운동2"
    },
    "20302": {
        "김동현": "이름",
        "A": "한국사1",
        "C": "중국어Ⅰ",
        "B": "빅데이터분석1",
        "D": "보건1&운동1"
    },
    "20303": {
        "김태윤": "이름",
        "A": "한국사2",
        "C": "일본어Ⅰ",
        "D": "빅데이터분석2",
        "B": "보건1&운동1"
    },
    "20304": {
        "류성열": "이름",
        "B": "한국사2",
        "A": "중국어Ⅰ",
        "C": "빅데이터분석1",
        "D": "보건2&운동2"
    },
    "20305": {
        "박선우": "이름",
        "B": "한국사1",
        "A": "일본어Ⅰ",
        "C": "빅데이터분석1",
        "D": "보건1&운동1"
    },
    "20306": {
        "박태인": "이름",
        "A": "한국사2",
        "B": "중국어Ⅰ",
        "C": "철학",
        "D": "보건1&운동1"
    },
    "20307": {
        "서민우": "이름",
        "B": "한국사1",
        "C": "중국어Ⅰ",
        "A": "빅데이터분석1",
        "D": "보건2&운동2"
    },
    "20308": {
        "설정현": "이름",
        "C": "한국사2",
        "A": "중국어Ⅰ",
        "D": "국제경제",
        "B": "보건1&운동1"
    },
    "20309": {
        "신형우": "이름",
        "D": "한국사1",
        "A": "중국어Ⅰ",
        "B": "빅데이터분석2",
        "C": "보건1&운동1"
    },
    "20310": {
        "안성준": "이름",
        "A": "한국사2",
        "D": "일본어Ⅰ",
        "B": "빅데이터분석1",
        "C": "보건2&운동2"
    },
    "20311": {
        "오성진": "이름",
        "A": "한국사2",
        "D": "중국어Ⅰ",
        "B": "빅데이터분석2",
        "C": "보건1&운동1"
    },
    "20312": {
        "유익재": "이름",
        "C": "한국사2",
        "D": "일본어Ⅰ",
        "A": "교육학",
        "B": "보건2&운동2"
    },
    "20313": {
        "윤준영": "이름",
        "B": "한국사2",
        "D": "중국어Ⅰ",
        "C": "빅데이터분석1",
        "A": "보건1&운동1"
    },
    "20315": {
        "이동호": "이름",
        "D": "한국사2",
        "C": "중국어Ⅰ",
        "B": "빅데이터분석2",
        "A": "보건2&운동2"
    },
    "20316": {
        "이종원": "이름",
        "A": "한국사1",
        "D": "중국어Ⅰ",
        "B": "심리학",
        "C": "보건1&운동1"
    },
    "20317": {
        "이준석": "이름",
        "D": "한국사1",
        "B": "중국어Ⅰ",
        "C": "빅데이터분석1",
        "A": "보건1&운동1"
    },
    "20318": {
        "이한선": "이름",
        "D": "한국사1",
        "C": "일본어Ⅰ",
        "B": "심리학",
        "A": "보건2&운동2"
    },
    "20319": {
        "정재환": "이름",
        "B": "한국사1",
        "C": "일본어Ⅰ",
        "A": "빅데이터분석2",
        "D": "보건2&운동2"
    },
    "20320": {
        "황동진": "이름",
        "C": "한국사2",
        "D": "일본어Ⅰ",
        "B": "빅데이터분석2",
        "A": "보건2&운동2"
    },
    "20401": {
        "김대희": "이름",
        "D": "한국사1",
        "C": "중국어Ⅰ",
        "B": "심리학",
        "A": "보건1&운동1"
    },
    "20403": {
        "김택윤": "이름",
        "B": "한국사1",
        "A": "중국어Ⅰ",
        "D": "빅데이터분석2",
        "C": "보건2&운동2"
    },
    "20404": {
        "박종우": "이름",
        "A": "한국사2",
        "B": "중국어Ⅰ",
        "C": "철학",
        "D": "보건1&운동1"
    },
    "20405": {
        "신경호": "이름",
        "A": "한국사1",
        "D": "일본어Ⅰ",
        "B": "빅데이터분석1",
        "C": "보건1&운동1"
    },
    "20406": {
        "신진": "이름",
        "C": "한국사2",
        "A": "일본어Ⅰ",
        "D": "빅데이터분석2",
        "B": "보건2&운동2"
    },
    "20407": {
        "양동혁": "이름",
        "D": "한국사2",
        "A": "일본어Ⅰ",
        "C": "빅데이터분석1",
        "B": "보건2&운동2"
    },
    "20408": {
        "유현빈": "이름",
        "A": "한국사2",
        "B": "중국어Ⅰ",
        "C": "빅데이터분석1",
        "D": "보건1&운동1"
    },
    "20409": {
        "윤호림": "이름",
        "C": "한국사1",
        "A": "일본어Ⅰ",
        "D": "빅데이터분석2",
        "B": "보건2&운동2"
    },
    "20410": {
        "이건우": "이름",
        "D": "한국사2",
        "C": "중국어Ⅰ",
        "A": "빅데이터분석2",
        "B": "보건2&운동2"
    },
    "20411": {
        "이광효": "이름",
        "A": "한국사1",
        "C": "일본어Ⅰ",
        "D": "빅데이터분석2",
        "B": "보건1&운동1"
    },
    "20412": {
        "이성진": "이름",
        "C": "한국사1",
        "D": "일본어Ⅰ",
        "B": "빅데이터분석1",
        "A": "보건1&운동1"
    },
    "20413": {
        "이원재": "이름",
        "C": "한국사2",
        "A": "중국어Ⅰ",
        "D": "빅데이터분석1",
        "B": "보건1&운동1"
    },
    "20414": {
        "이찬": "이름",
        "C": "한국사2",
        "D": "중국어Ⅰ",
        "B": "빅데이터분석2",
        "A": "보건1&운동1"
    },
    "20415": {
        "이희호": "이름",
        "A": "한국사1",
        "B": "중국어Ⅰ",
        "D": "빅데이터분석2",
        "C": "보건2&운동2"
    },
    "20416": {
        "정윤찬": "이름",
        "A": "한국사1",
        "D": "일본어Ⅰ",
        "B": "빅데이터분석1",
        "C": "보건1&운동1"
    },
    "20417": {
        "조현준": "이름",
        "D": "한국사2",
        "B": "일본어Ⅰ",
        "A": "빅데이터분석1",
        "C": "보건1&운동1"
    },
    "20419": {
        "한상연": "이름",
        "D": "한국사2",
        "A": "중국어Ⅰ",
        "C": "빅데이터분석2",
        "B": "보건2&운동2"
    },
    "20420": {
        "황인승": "이름",
        "A": "한국사1",
        "D": "중국어Ⅰ",
        "C": "빅데이터분석2",
        "B": "보건2&운동2"
    },
    "20501": {
        "강민준": "이름",
        "C": "한국사1",
        "D": "중국어Ⅰ",
        "A": "교육학",
        "B": "보건2&운동2"
    },
    "20502": {
        "김건우": "이름",
        "C": "한국사2",
        "A": "중국어Ⅰ",
        "D": "국제경제",
        "B": "보건1&운동1"
    },
    "20503": {
        "김기민": "이름",
        "A": "한국사1",
        "B": "일본어Ⅰ",
        "C": "철학",
        "D": "보건2&운동2"
    },
    "20504": {
        "김용기": "이름",
        "B": "한국사1",
        "C": "일본어Ⅰ",
        "D": "빅데이터분석2",
        "A": "보건1&운동1"
    },
    "20505": {
        "김창현": "이름",
        "B": "한국사2",
        "D": "일본어Ⅰ",
        "A": "빅데이터분석1",
        "C": "보건1&운동1"
    },
    "20506": {
        "류견우": "이름",
        "C": "한국사2",
        "B": "일본어Ⅰ",
        "A": "빅데이터분석2",
        "D": "보건1&운동1"
    },
    "20507": {
        "배동준": "이름",
        "A": "한국사1",
        "C": "일본어Ⅰ",
        "D": "국제경제",
        "B": "보건2&운동2"
    },
    "20508": {
        "신문선": "이름",
        "D": "한국사2",
        "B": "일본어Ⅰ",
        "C": "빅데이터분석2",
        "A": "보건2&운동2"
    },
    "20509": {
        "신원호": "이름",
        "A": "한국사2",
        "D": "일본어Ⅰ",
        "C": "철학",
        "B": "보건2&운동2"
    },
    "20510": {
        "오준석": "이름",
        "B": "한국사2",
        "A": "일본어Ⅰ",
        "C": "빅데이터분석2",
        "D": "보건1&운동1"
    },
    "20512": {
        "이민찬": "이름",
        "D": "한국사2",
        "C": "일본어Ⅰ",
        "B": "빅데이터분석1",
        "A": "보건1&운동1"
    },
    "20513": {
        "이선용": "이름",
        "D": "한국사2",
        "B": "중국어Ⅰ",
        "A": "빅데이터분석1",
        "C": "보건1&운동1"
    },
    "20514": {
        "이선행": "이름",
        "C": "한국사2",
        "A": "일본어Ⅰ",
        "D": "빅데이터분석1",
        "B": "보건1&운동1"
    },
    "20515": {
        "이재혁": "이름",
        "C": "한국사1",
        "B": "중국어Ⅰ",
        "D": "국제경제",
        "A": "보건2&운동2"
    },
    "20516": {
        "이정우": "이름",
        "A": "한국사1",
        "B": "중국어Ⅰ",
        "D": "국제경제",
        "C": "보건1&운동1"
    },
    "20517": {
        "이형원": "이름",
        "D": "한국사2",
        "C": "중국어Ⅰ",
        "A": "빅데이터분석2",
        "B": "보건2&운동2"
    },
    "20518": {
        "장지후": "이름",
        "D": "한국사2",
        "B": "일본어Ⅰ",
        "C": "빅데이터분석2",
        "A": "보건2&운동2"
    },
    "20519": {
        "조현준": "이름",
        "B": "한국사1",
        "C": "중국어Ⅰ",
        "A": "빅데이터분석2",
        "D": "보건1&운동1"
    },
    "20520": {
        "홍석준": "이름",
        "C": "한국사2",
        "D": "일본어Ⅰ",
        "B": "빅데이터분석2",
        "A": "보건2&운동2"
    },
    "20601": {
        "강경훈": "이름",
        "B": "한국사2",
        "A": "일본어Ⅰ",
        "D": "국제경제",
        "C": "보건2&운동2"
    },
    "20602": {
        "강동협": "이름",
        "A": "한국사1",
        "B": "일본어Ⅰ",
        "C": "빅데이터분석2",
        "D": "보건2&운동2"
    },
    "20603": {
        "구민회": "이름",
        "D": "한국사1",
        "B": "일본어Ⅰ",
        "C": "빅데이터분석2",
        "A": "보건2&운동2"
    },
    "20604": {
        "권민석": "이름",
        "D": "한국사1",
        "B": "중국어Ⅰ",
        "C": "빅데이터분석2",
        "A": "보건2&운동2"
    },
    "20605": {
        "김대영": "이름",
        "C": "한국사2",
        "B": "중국어Ⅰ",
        "A": "교육학",
        "D": "보건2&운동2"
    },
    "20606": {
        "김현우": "이름",
        "D": "한국사1",
        "A": "중국어Ⅰ",
        "B": "심리학",
        "C": "보건1&운동1"
    },
    "20607": {
        "서지호": "이름",
        "A": "한국사1",
        "D": "중국어Ⅰ",
        "B": "빅데이터분석2",
        "C": "보건2&운동2"
    },
    "20608": {
        "안종훈": "이름",
        "C": "한국사1",
        "D": "중국어Ⅰ",
        "A": "빅데이터분석2",
        "B": "보건2&운동2"
    },
    "20609": {
        "윤재현": "이름",
        "A": "한국사2",
        "C": "일본어Ⅰ",
        "B": "빅데이터분석2",
        "D": "보건1&운동1"
    },
    "20610": {
        "이상원": "이름",
        "A": "한국사2",
        "C": "일본어Ⅰ",
        "B": "빅데이터분석1",
        "D": "보건1&운동1"
    },
    "20611": {
        "이성철": "이름",
        "C": "한국사1",
        "A": "일본어Ⅰ",
        "D": "빅데이터분석1",
        "B": "보건1&운동1"
    },
    "20612": {
        "임범진": "이름",
        "B": "한국사2",
        "D": "일본어Ⅰ",
        "A": "교육학",
        "C": "보건2&운동2"
    },
    "20613": {
        "장민석": "이름",
        "B": "한국사2",
        "D": "일본어Ⅰ",
        "A": "빅데이터분석1",
        "C": "보건1&운동1"
    },
    "20614": {
        "전성호": "이름",
        "B": "한국사2",
        "A": "일본어Ⅰ",
        "C": "철학",
        "D": "보건1&운동1"
    },
    "20615": {
        "정원영": "이름",
        "D": "한국사2",
        "B": "일본어Ⅰ",
        "A": "빅데이터분석2",
        "C": "보건2&운동2"
    },
    "20616": {
        "조승준": "이름",
        "A": "한국사1",
        "C": "중국어Ⅰ",
        "D": "빅데이터분석2",
        "B": "보건1&운동1"
    },
    "20617": {
        "조정원": "이름",
        "B": "한국사2",
        "C": "일본어Ⅰ",
        "A": "빅데이터분석1",
        "D": "보건2&운동2"
    },
    "20618": {
        "조현우": "이름",
        "D": "한국사2",
        "A": "중국어Ⅰ",
        "B": "심리학",
        "C": "보건1&운동1"
    },
    "20619": {
        "홍기영": "이름",
        "C": "한국사1",
        "B": "중국어Ⅰ",
        "D": "국제경제",
        "A": "보건2&운동2"
    },
    "20701": {
        "강동옥": "이름",
        "B": "한국사1",
        "C": "일본어Ⅰ",
        "A": "빅데이터분석1",
        "D": "보건1&운동1"
    },
    "20702": {
        "강동완": "이름",
        "D": "한국사1",
        "B": "중국어Ⅰ",
        "A": "교육학",
        "C": "보건2&운동2"
    },
    "20703": {
        "곽준석": "이름",
        "A": "한국사1",
        "D": "중국어Ⅰ",
        "B": "심리학",
        "C": "보건1&운동1"
    },
    "20704": {
        "김동훈": "이름",
        "A": "한국사1",
        "C": "일본어Ⅰ",
        "B": "빅데이터분석2",
        "D": "보건2&운동2"
    },
    "20705": {
        "김민준": "이름",
        "D": "한국사1",
        "B": "일본어Ⅰ",
        "A": "빅데이터분석1",
        "C": "보건2&운동2"
    },
    "20706": {
        "김선홍": "이름",
        "D": "한국사2",
        "B": "중국어Ⅰ",
        "C": "빅데이터분석1",
        "A": "보건1&운동1"
    },
    "20707": {
        "김영민": "이름",
        "B": "한국사2",
        "D": "중국어Ⅰ",
        "C": "철학",
        "A": "보건2&운동2"
    },
    "20708": {
        "김영진": "이름",
        "D": "한국사1",
        "A": "중국어Ⅰ",
        "B": "빅데이터분석1",
        "C": "보건2&운동2"
    },
    "20709": {
        "김웅배": "이름",
        "D": "한국사1",
        "C": "일본어Ⅰ",
        "B": "빅데이터분석1",
        "A": "보건2&운동2"
    },
    "20710": {
        "김준환": "이름",
        "C": "한국사2",
        "B": "중국어Ⅰ",
        "D": "빅데이터분석1",
        "A": "보건1&운동1"
    },
    "20711": {
        "박선웅": "이름",
        "B": "한국사1",
        "A": "중국어Ⅰ",
        "D": "빅데이터분석1",
        "C": "보건1&운동1"
    },
    "20712": {
        "박용준": "이름",
        "D": "한국사1",
        "A": "중국어Ⅰ",
        "B": "빅데이터분석2",
        "C": "보건1&운동1"
    },
    "20713": {
        "박유신": "이름",
        "C": "한국사1",
        "A": "중국어Ⅰ",
        "D": "국제경제",
        "B": "보건1&운동1"
    },
    "20714": {
        "송지훈": "이름",
        "A": "한국사2",
        "B": "중국어Ⅰ",
        "C": "철학",
        "D": "보건1&운동1"
    },
    "20715": {
        "윤지훈": "이름",
        "D": "한국사1",
        "C": "중국어Ⅰ",
        "B": "심리학",
        "A": "보건2&운동2"
    },
    "20716": {
        "이동건": "이름",
        "A": "한국사2",
        "C": "중국어Ⅰ",
        "B": "빅데이터분석1",
        "D": "보건1&운동1"
    },
    "20717": {
        "이상현": "이름",
        "B": "한국사2",
        "D": "중국어Ⅰ",
        "C": "철학",
        "A": "보건1&운동1"
    },
    "20718": {
        "전성현": "이름",
        "C": "한국사2",
        "D": "일본어Ⅰ",
        "A": "교육학",
        "B": "보건1&운동1"
    },
    "20719": {
        "최석헌": "이름",
        "C": "한국사1",
        "A": "중국어Ⅰ",
        "D": "빅데이터분석1",
        "B": "보건1&운동1"
    },
    "20720": {
        "현윤수": "이름",
        "B": "한국사1",
        "D": "중국어Ⅰ",
        "C": "빅데이터분석2",
        "A": "보건2&운동2"
    },
    "20801": {
        "김대헌": "이름",
        "D": "한국사2",
        "A": "일본어Ⅰ",
        "B": "심리학",
        "C": "보건1&운동1"
    },
    "20802": {
        "김서원": "이름",
        "C": "한국사2",
        "A": "일본어Ⅰ",
        "B": "빅데이터분석1",
        "D": "보건2&운동2"
    },
    "20803": {
        "김신원": "이름",
        "B": "한국사2",
        "C": "일본어Ⅰ",
        "D": "빅데이터분석1",
        "A": "보건2&운동2"
    },
    "20804": {
        "김은호": "이름",
        "D": "한국사2",
        "B": "일본어Ⅰ",
        "C": "빅데이터분석2",
        "A": "보건2&운동2"
    },
    "20805": {
        "김정우": "이름",
        "B": "한국사1",
        "D": "중국어Ⅰ",
        "C": "철학",
        "A": "보건1&운동1"
    },
    "20806": {
        "김태현": "이름",
        "A": "한국사2",
        "C": "중국어Ⅰ",
        "D": "빅데이터분석1",
        "B": "보건2&운동2"
    },
    "20807": {
        "박형기": "이름",
        "B": "한국사1",
        "A": "일본어Ⅰ",
        "C": "빅데이터분석2",
        "D": "보건2&운동2"
    },
    "20808": {
        "백경민": "이름",
        "B": "한국사1",
        "D": "중국어Ⅰ",
        "C": "빅데이터분석2",
        "A": "보건2&운동2"
    },
    "20809": {
        "손예준": "이름",
        "D": "한국사2",
        "B": "일본어Ⅰ",
        "C": "철학",
        "A": "보건1&운동1"
    },
    "20810": {
        "신동훈": "이름",
        "A": "한국사2",
        "D": "중국어Ⅰ",
        "B": "빅데이터분석2",
        "C": "보건2&운동2"
    },
    "20811": {
        "염정운": "이름",
        "D": "한국사1",
        "B": "일본어Ⅰ",
        "C": "철학",
        "A": "보건1&운동1"
    },
    "20812": {
        "우지성": "이름",
        "D": "한국사2",
        "A": "일본어Ⅰ",
        "C": "철학",
        "B": "보건1&운동1"
    },
    "20813": {
        "윤서범": "이름",
        "B": "한국사1",
        "D": "중국어Ⅰ",
        "A": "빅데이터분석2",
        "C": "보건2&운동2"
    },
    "20814": {
        "이용규": "이름",
        "C": "한국사1",
        "A": "중국어Ⅰ",
        "B": "빅데이터분석2",
        "D": "보건2&운동2"
    },
    "20815": {
        "이준혁": "이름",
        "B": "한국사2",
        "C": "중국어Ⅰ",
        "A": "빅데이터분석1",
        "D": "보건2&운동2"
    },
    "20816": {
        "이한별": "이름",
        "A": "한국사2",
        "C": "일본어Ⅰ",
        "D": "빅데이터분석1",
        "B": "보건1&운동1"
    },
    "20817": {
        "장준혁": "이름",
        "A": "한국사2",
        "B": "일본어Ⅰ",
        "C": "철학",
        "D": "보건1&운동1"
    },
    "20818": {
        "정승민": "이름",
        "A": "한국사2",
        "C": "일본어Ⅰ",
        "D": "빅데이터분석1",
        "B": "보건1&운동1"
    },
    "20819": {
        "정승연": "이름",
        "D": "한국사1",
        "A": "일본어Ⅰ",
        "B": "빅데이터분석1",
        "C": "보건1&운동1"
    },
    "20820": {
        "최규현": "이름",
        "B": "한국사2",
        "A": "일본어Ⅰ",
        "C": "철학",
        "D": "보건1&운동1"
    }
}
const list4 = {
    "20101": {
        "고정명": "이름",
        "B": "독서2",
        "D": "수학Ⅱ-1",
        "A": "확률과통계1",
        "E": "영어Ⅱ-2",
        "C": "물리학Ⅰ",
        "F": "정보과학"
    },
    "20102": {
        "김민찬": "이름",
        "B": "독서1",
        "A": "수학Ⅱ-1",
        "C": "확률과통계1",
        "E": "영어Ⅱ-2",
        "D": "물리학Ⅱ",
        "F": "화학Ⅰ"
    },
    "20103": {
        "김보석": "이름",
        "F": "독서1",
        "B": "수학Ⅱ-2",
        "A": "확률과통계2",
        "E": "영어Ⅱ-2",
        "D": "물리학Ⅱ",
        "C": "지구과학Ⅰ"
    },
    "20104": {
        "도경수": "이름",
        "F": "독서1",
        "D": "수학Ⅱ-2",
        "C": "확률과통계1",
        "B": "영어Ⅱ-2",
        "E": "화학Ⅱ",
        "A": "생명과학Ⅰ"
    },
    "20105": {
        "문현빈": "이름",
        "F": "독서1",
        "D": "수학Ⅱ-2",
        "A": "확률과통계2",
        "B": "영어Ⅱ-1",
        "C": "물리학Ⅰ",
        "E": "화학Ⅰ"
    },
    "20106": {
        "박대현": "이름",
        "D": "독서2",
        "C": "수학Ⅱ-2",
        "E": "영어Ⅱ-2",
        "F": "영미문학읽기",
        "A": "생명과학Ⅰ",
        "B": "경제"
    },
    "20107": {
        "박문수": "이름",
        "D": "독서2",
        "E": "수학Ⅱ-2",
        "A": "확률과통계1",
        "C": "영어Ⅱ-1",
        "F": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20108": {
        "박민준": "이름",
        "A": "독서2",
        "C": "고전읽기",
        "D": "수학Ⅱ-2",
        "F": "영어Ⅱ-2",
        "B": "지구과학Ⅰ",
        "E": "사회문화"
    },
    "20109": {
        "박준용": "이름",
        "D": "독서2",
        "A": "수학Ⅱ-1",
        "F": "확률과통계1",
        "B": "영어Ⅱ-2",
        "C": "물리학Ⅰ",
        "E": "화학Ⅱ"
    },
    "20110": {
        "박찬응": "이름",
        "D": "독서2",
        "C": "고전읽기",
        "F": "수학Ⅱ-1",
        "A": "영어Ⅱ-1",
        "B": "지구과학Ⅰ",
        "E": "세계사"
    },
    "20111": {
        "서정호": "이름",
        "D": "독서2",
        "C": "고전읽기",
        "A": "수학Ⅱ-1",
        "E": "영어Ⅱ-2",
        "F": "화학Ⅰ",
        "B": "지구과학Ⅰ"
    },
    "20112": {
        "송종휘": "이름",
        "C": "독서2",
        "E": "수학Ⅱ-2",
        "A": "확률과통계1",
        "D": "영어Ⅱ-1",
        "B": "화학Ⅰ",
        "F": "정보과학"
    },
    "20113": {
        "유충근": "이름",
        "D": "독서2",
        "C": "수학Ⅱ-2",
        "A": "확률과통계1",
        "F": "영어Ⅱ-2",
        "B": "생명과학Ⅱ",
        "E": "윤리와 사상"
    },
    "20114": {
        "이우진": "이름",
        "A": "독서2",
        "C": "고전읽기",
        "D": "수학Ⅱ-2",
        "F": "영어Ⅱ-2",
        "B": "지구과학Ⅰ",
        "E": "세계사"
    },
    "20115": {
        "이준형": "이름",
        "D": "독서2",
        "B": "수학Ⅱ-2",
        "A": "확률과통계1",
        "C": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "F": "화학Ⅰ"
    },
    "20116": {
        "임창대": "이름",
        "B": "독서2",
        "E": "수학Ⅱ-1",
        "A": "확률과통계1",
        "D": "영어Ⅱ-1",
        "C": "물리학Ⅰ",
        "F": "정보과학"
    },
    "20117": {
        "조태상": "이름",
        "D": "독서2",
        "C": "수학Ⅱ-2",
        "F": "확률과통계1",
        "A": "영어Ⅱ-1",
        "E": "화학Ⅱ",
        "B": "경제"
    },
    "20118": {
        "최시형": "이름",
        "E": "독서1",
        "B": "수학Ⅱ-2",
        "C": "확률과통계1",
        "A": "영어Ⅱ-2",
        "D": "물리학Ⅱ",
        "F": "화학Ⅰ"
    },
    "20119": {
        "최진혁": "이름",
        "C": "독서2",
        "B": "수학Ⅱ-2",
        "D": "확률과통계1",
        "A": "영어Ⅱ-2",
        "E": "물리학Ⅱ",
        "F": "화학Ⅰ"
    },
    "20120": {
        "최현준": "이름",
        "F": "독서1",
        "C": "고전읽기",
        "D": "수학Ⅱ-2",
        "A": "영어Ⅱ-2",
        "B": "지구과학Ⅰ",
        "E": "윤리와 사상"
    },
    "20201": {
        "김도현": "이름",
        "F": "독서2",
        "A": "수학Ⅱ-1",
        "B": "확률과통계1",
        "C": "영어Ⅱ-1",
        "D": "물리학Ⅱ",
        "E": "화학Ⅰ"
    },
    "20202": {
        "김서진": "이름",
        "F": "독서1",
        "E": "수학Ⅱ-2",
        "D": "확률과통계1",
        "B": "영어Ⅱ-2",
        "C": "물리학Ⅰ",
        "A": "생명과학Ⅰ"
    },
    "20203": {
        "김지석": "이름",
        "F": "독서2",
        "A": "수학Ⅱ-1",
        "B": "확률과통계1",
        "E": "영어Ⅱ-2",
        "D": "물리학Ⅱ",
        "C": "지구과학Ⅰ"
    },
    "20205": {
        "김태훈": "이름",
        "D": "독서1",
        "F": "수학Ⅱ-1",
        "A": "확률과통계2",
        "B": "영어Ⅱ-1",
        "C": "물리학Ⅰ",
        "E": "화학Ⅱ"
    },
    "20206": {
        "박규용": "이름",
        "F": "독서1",
        "D": "수학Ⅱ-1",
        "A": "확률과통계2",
        "C": "영어Ⅱ-1",
        "E": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20207": {
        "박선욱": "이름",
        "B": "독서2",
        "C": "수학Ⅱ-2",
        "A": "영어Ⅱ-1",
        "F": "영미문학읽기",
        "E": "사회문화",
        "D": "생활과 윤리"
    },
    "20208": {
        "박정호": "이름",
        "C": "독서2",
        "D": "수학Ⅱ-2",
        "A": "확률과통계1",
        "E": "영어Ⅱ-2",
        "B": "화학Ⅰ",
        "F": "정치와법"
    },
    "20209": {
        "우상범": "이름",
        "C": "독서1",
        "A": "수학Ⅱ-1",
        "B": "확률과통계1",
        "F": "영어Ⅱ-2",
        "E": "사회문화",
        "D": "한국지리"
    },
    "20210": {
        "윤상원": "이름",
        "A": "독서2",
        "B": "수학Ⅱ-2",
        "D": "영어Ⅱ-1",
        "F": "영미문학읽기",
        "C": "지구과학Ⅰ",
        "E": "사회문화"
    },
    "20211": {
        "이강선": "이름",
        "A": "독서2",
        "E": "수학Ⅱ-1",
        "D": "확률과통계1",
        "C": "영어Ⅱ-1",
        "F": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20212": {
        "이도근": "이름",
        "F": "독서1",
        "C": "수학Ⅱ-2",
        "A": "확률과통계2",
        "D": "영어Ⅱ-1",
        "E": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20213": {
        "임원호": "이름",
        "C": "독서1",
        "D": "수학Ⅱ-2",
        "F": "확률과통계1",
        "A": "영어Ⅱ-1",
        "E": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20214": {
        "장정호": "이름",
        "C": "독서1",
        "A": "수학Ⅱ-1",
        "E": "확률과통계1",
        "D": "영어Ⅱ-1",
        "F": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20215": {
        "전한결": "이름",
        "F": "독서1",
        "C": "수학Ⅱ-2",
        "D": "확률과통계1",
        "B": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "A": "화학Ⅰ"
    },
    "20216": {
        "최현서": "이름",
        "F": "독서1",
        "C": "고전읽기",
        "D": "수학Ⅱ-1",
        "A": "영어Ⅱ-2",
        "B": "지구과학Ⅰ",
        "E": "윤리와 사상"
    },
    "20217": {
        "태현준": "이름",
        "C": "독서1",
        "D": "수학Ⅱ-2",
        "B": "확률과통계1",
        "A": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "F": "화학Ⅰ"
    },
    "20218": {
        "한결": "이름",
        "D": "독서2",
        "F": "수학Ⅱ-1",
        "C": "확률과통계1",
        "B": "영어Ⅱ-2",
        "E": "물리학Ⅱ",
        "A": "화학Ⅰ"
    },
    "20219": {
        "한동현": "이름",
        "A": "독서2",
        "C": "수학Ⅱ-2",
        "B": "영어Ⅱ-2",
        "F": "영미문학읽기",
        "D": "한국지리",
        "E": "세계사"
    },
    "20220": {
        "한재윤": "이름",
        "C": "독서1",
        "B": "수학Ⅱ-2",
        "A": "영어Ⅱ-1",
        "F": "영미문학읽기",
        "E": "사회문화",
        "D": "생활과 윤리"
    },
    "20301": {
        "강준영": "이름",
        "D": "독서2",
        "F": "수학Ⅱ-1",
        "A": "확률과통계1",
        "B": "영어Ⅱ-2",
        "C": "물리학Ⅰ",
        "E": "화학Ⅱ"
    },
    "20302": {
        "김동현": "이름",
        "D": "독서2",
        "A": "수학Ⅱ-1",
        "E": "확률과통계1",
        "C": "영어Ⅱ-1",
        "B": "화학Ⅰ",
        "F": "정보과학"
    },
    "20303": {
        "김태윤": "이름",
        "E": "독서1",
        "D": "수학Ⅱ-2",
        "F": "확률과통계1",
        "A": "영어Ⅱ-2",
        "C": "물리학Ⅰ",
        "B": "지구과학Ⅰ"
    },
    "20304": {
        "류성열": "이름",
        "D": "독서2",
        "C": "수학Ⅱ-2",
        "F": "확률과통계1",
        "A": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "B": "지구과학Ⅰ"
    },
    "20305": {
        "박선우": "이름",
        "A": "독서2",
        "F": "수학Ⅱ-1",
        "B": "확률과통계1",
        "D": "영어Ⅱ-1",
        "C": "물리학Ⅰ",
        "E": "화학Ⅱ"
    },
    "20306": {
        "박태인": "이름",
        "C": "독서2",
        "B": "수학Ⅱ-2",
        "E": "확률과통계1",
        "F": "영어Ⅱ-2",
        "D": "물리학Ⅱ",
        "A": "화학Ⅰ"
    },
    "20307": {
        "서민우": "이름",
        "E": "독서1",
        "B": "수학Ⅱ-2",
        "F": "확률과통계1",
        "C": "영어Ⅱ-1",
        "D": "물리학Ⅱ",
        "A": "화학Ⅰ"
    },
    "20308": {
        "설정현": "이름",
        "F": "독서1",
        "A": "수학Ⅱ-1",
        "B": "확률과통계1",
        "C": "영어Ⅱ-1",
        "D": "생활과 윤리",
        "E": "윤리와 사상"
    },
    "20309": {
        "신형우": "이름",
        "B": "독서1",
        "F": "수학Ⅱ-1",
        "A": "확률과통계2",
        "C": "영어Ⅱ-1",
        "D": "물리학Ⅱ",
        "E": "화학Ⅰ"
    },
    "20310": {
        "안성준": "이름",
        "C": "독서1",
        "D": "수학Ⅱ-2",
        "F": "확률과통계1",
        "B": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "A": "화학Ⅰ"
    },
    "20311": {
        "오성진": "이름",
        "F": "독서1",
        "C": "수학Ⅱ-2",
        "B": "확률과통계1",
        "E": "영어Ⅱ-2",
        "A": "생명과학Ⅰ",
        "D": "생활과 윤리"
    },
    "20312": {
        "유익재": "이름",
        "B": "독서2",
        "D": "수학Ⅱ-2",
        "F": "확률과통계1",
        "A": "영어Ⅱ-1",
        "C": "물리학Ⅰ",
        "E": "화학Ⅱ"
    },
    "20313": {
        "윤준영": "이름",
        "F": "독서1",
        "A": "수학Ⅱ-1",
        "D": "확률과통계1",
        "C": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "B": "화학Ⅰ"
    },
    "20315": {
        "이동호": "이름",
        "C": "독서2",
        "D": "수학Ⅱ-1",
        "A": "확률과통계1",
        "B": "영어Ⅱ-2",
        "E": "물리학Ⅱ",
        "F": "정보과학"
    },
    "20316": {
        "이종원": "이름",
        "C": "독서2",
        "B": "수학Ⅱ-2",
        "D": "영어Ⅱ-1",
        "F": "영미문학읽기",
        "E": "화학Ⅱ",
        "A": "생명과학Ⅰ"
    },
    "20317": {
        "이준석": "이름",
        "F": "독서1",
        "B": "수학Ⅱ-2",
        "D": "확률과통계1",
        "E": "영어Ⅱ-2",
        "A": "화학Ⅰ",
        "C": "지구과학Ⅰ"
    },
    "20318": {
        "이한선": "이름",
        "C": "독서1",
        "F": "수학Ⅱ-1",
        "A": "확률과통계2",
        "B": "영어Ⅱ-2",
        "E": "화학Ⅰ",
        "D": "생활과 윤리"
    },
    "20319": {
        "정재환": "이름",
        "C": "독서2",
        "B": "수학Ⅱ-2",
        "D": "확률과통계1",
        "F": "영어Ⅱ-2",
        "E": "물리학Ⅱ",
        "A": "화학Ⅰ"
    },
    "20320": {
        "황동진": "이름",
        "C": "독서1",
        "A": "수학Ⅱ-1",
        "F": "확률과통계1",
        "D": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "B": "화학Ⅰ"
    },
    "20401": {
        "김대희": "이름",
        "D": "독서1",
        "F": "수학Ⅱ-1",
        "C": "확률과통계1",
        "B": "영어Ⅱ-1",
        "E": "화학Ⅱ",
        "A": "생명과학Ⅰ"
    },
    "20403": {
        "김택윤": "이름",
        "F": "독서1",
        "D": "수학Ⅱ-2",
        "E": "확률과통계1",
        "A": "영어Ⅱ-1",
        "C": "물리학Ⅰ",
        "B": "화학Ⅰ"
    },
    "20404": {
        "박종우": "이름",
        "B": "독서2",
        "E": "수학Ⅱ-1",
        "D": "확률과통계1",
        "F": "영어Ⅱ-2",
        "C": "물리학Ⅰ",
        "A": "화학Ⅰ"
    },
    "20405": {
        "신경호": "이름",
        "C": "독서1",
        "E": "수학Ⅱ-1",
        "F": "확률과통계1",
        "B": "영어Ⅱ-1",
        "D": "물리학Ⅱ",
        "A": "화학Ⅰ"
    },
    "20406": {
        "신진": "이름",
        "C": "독서1",
        "B": "수학Ⅱ-2",
        "F": "확률과통계1",
        "E": "영어Ⅱ-2",
        "D": "물리학Ⅱ",
        "A": "화학Ⅰ"
    },
    "20407": {
        "양동혁": "이름",
        "F": "독서1",
        "A": "수학Ⅱ-1",
        "D": "확률과통계1",
        "C": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "B": "화학Ⅰ"
    },
    "20408": {
        "유현빈": "이름",
        "B": "독서1",
        "F": "수학Ⅱ-1",
        "A": "확률과통계2",
        "D": "영어Ⅱ-1",
        "C": "물리학Ⅰ",
        "E": "화학Ⅱ"
    },
    "20409": {
        "윤호림": "이름",
        "B": "독서2",
        "E": "수학Ⅱ-2",
        "C": "확률과통계1",
        "F": "영어Ⅱ-2",
        "D": "물리학Ⅱ",
        "A": "화학Ⅰ"
    },
    "20410": {
        "이건우": "이름",
        "F": "독서2",
        "E": "수학Ⅱ-2",
        "C": "확률과통계1",
        "D": "영어Ⅱ-1",
        "A": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20411": {
        "이광효": "이름",
        "F": "독서2",
        "D": "수학Ⅱ-1",
        "C": "확률과통계1",
        "B": "영어Ⅱ-1",
        "E": "화학Ⅰ",
        "A": "생명과학Ⅰ"
    },
    "20412": {
        "이성진": "이름",
        "A": "독서2",
        "C": "수학Ⅱ-2",
        "E": "확률과통계1",
        "D": "영어Ⅱ-1",
        "F": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20413": {
        "이원재": "이름",
        "E": "독서1",
        "D": "수학Ⅱ-2",
        "F": "확률과통계1",
        "C": "영어Ⅱ-1",
        "A": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20414": {
        "이찬": "이름",
        "A": "독서2",
        "B": "수학Ⅱ-2",
        "E": "확률과통계1",
        "C": "영어Ⅱ-1",
        "D": "물리학Ⅱ",
        "F": "화학Ⅰ"
    },
    "20415": {
        "이희호": "이름",
        "D": "독서2",
        "C": "수학Ⅱ-2",
        "A": "확률과통계1",
        "B": "영어Ⅱ-2",
        "E": "물리학Ⅱ",
        "F": "화학Ⅰ"
    },
    "20416": {
        "정윤찬": "이름",
        "C": "독서2",
        "D": "수학Ⅱ-1",
        "B": "영어Ⅱ-2",
        "F": "영미문학읽기",
        "E": "화학Ⅱ",
        "A": "생명과학Ⅰ"
    },
    "20417": {
        "조현준": "이름",
        "E": "독서1",
        "B": "수학Ⅱ-2",
        "A": "확률과통계2",
        "C": "영어Ⅱ-1",
        "D": "물리학Ⅱ",
        "F": "정보과학"
    },
    "20419": {
        "한상연": "이름",
        "C": "독서2",
        "E": "수학Ⅱ-2",
        "D": "확률과통계1",
        "F": "영어Ⅱ-2",
        "B": "화학Ⅰ",
        "A": "생명과학Ⅰ"
    },
    "20420": {
        "황인승": "이름",
        "C": "독서1",
        "D": "수학Ⅱ-2",
        "F": "확률과통계1",
        "A": "영어Ⅱ-1",
        "E": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20501": {
        "강민준": "이름",
        "C": "독서2",
        "E": "수학Ⅱ-1",
        "D": "확률과통계1",
        "A": "영어Ⅱ-2",
        "F": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20502": {
        "김건우": "이름",
        "A": "독서2",
        "C": "고전읽기",
        "D": "수학Ⅱ-2",
        "B": "영어Ⅱ-2",
        "F": "정치와법",
        "E": "윤리와 사상"
    },
    "20503": {
        "김기민": "이름",
        "D": "독서2",
        "B": "수학Ⅱ-2",
        "A": "확률과통계1",
        "F": "영어Ⅱ-2",
        "C": "물리학Ⅰ",
        "E": "화학Ⅱ"
    },
    "20504": {
        "김용기": "이름",
        "B": "독서1",
        "A": "수학Ⅱ-1",
        "C": "확률과통계1",
        "E": "영어Ⅱ-2",
        "D": "물리학Ⅱ",
        "F": "화학Ⅰ"
    },
    "20505": {
        "김창현": "이름",
        "D": "독서2",
        "F": "수학Ⅱ-1",
        "B": "확률과통계1",
        "A": "영어Ⅱ-2",
        "E": "화학Ⅱ",
        "C": "지구과학Ⅰ"
    },
    "20506": {
        "류견우": "이름",
        "D": "독서2",
        "F": "수학Ⅱ-1",
        "A": "확률과통계2",
        "B": "영어Ⅱ-1",
        "C": "물리학Ⅰ",
        "E": "화학Ⅱ"
    },
    "20507": {
        "배동준": "이름",
        "E": "독서1",
        "C": "고전읽기",
        "B": "수학Ⅱ-2",
        "A": "영어Ⅱ-1",
        "F": "정치와법",
        "D": "한국지리"
    },
    "20508": {
        "신문선": "이름",
        "B": "독서1",
        "E": "수학Ⅱ-1",
        "C": "확률과통계1",
        "A": "영어Ⅱ-1",
        "D": "물리학Ⅱ",
        "F": "정보과학"
    },
    "20509": {
        "신원호": "이름",
        "E": "독서1",
        "D": "수학Ⅱ-1",
        "F": "확률과통계1",
        "B": "영어Ⅱ-1",
        "A": "화학Ⅰ",
        "C": "지구과학Ⅰ"
    },
    "20510": {
        "오준석": "이름",
        "C": "독서2",
        "E": "수학Ⅱ-1",
        "D": "확률과통계1",
        "B": "영어Ⅱ-2",
        "F": "화학Ⅰ",
        "A": "생명과학Ⅰ"
    },
    "20512": {
        "이민찬": "이름",
        "B": "독서1",
        "C": "수학Ⅱ-2",
        "F": "확률과통계1",
        "A": "영어Ⅱ-1",
        "E": "사회문화",
        "D": "생활과 윤리"
    },
    "20513": {
        "이선용": "이름",
        "D": "독서1",
        "E": "수학Ⅱ-1",
        "C": "확률과통계1",
        "B": "영어Ⅱ-1",
        "A": "화학Ⅰ",
        "F": "정보과학"
    },
    "20514": {
        "이선행": "이름",
        "F": "독서2",
        "E": "수학Ⅱ-1",
        "D": "확률과통계1",
        "A": "영어Ⅱ-2",
        "C": "물리학Ⅰ",
        "B": "지구과학Ⅰ"
    },
    "20515": {
        "이재혁": "이름",
        "A": "독서2",
        "D": "수학Ⅱ-1",
        "C": "영어Ⅱ-1",
        "F": "영미문학읽기",
        "B": "지구과학Ⅰ",
        "E": "사회문화"
    },
    "20516": {
        "이정우": "이름",
        "F": "독서2",
        "D": "수학Ⅱ-1",
        "C": "확률과통계1",
        "A": "영어Ⅱ-1",
        "B": "지구과학Ⅰ",
        "E": "윤리와 사상"
    },
    "20517": {
        "이형원": "이름",
        "F": "독서2",
        "A": "수학Ⅱ-1",
        "E": "확률과통계1",
        "B": "영어Ⅱ-1",
        "C": "지구과학Ⅰ",
        "D": "한국지리"
    },
    "20518": {
        "장지후": "이름",
        "C": "독서1",
        "E": "수학Ⅱ-2",
        "F": "확률과통계1",
        "A": "영어Ⅱ-2",
        "D": "물리학Ⅱ",
        "B": "화학Ⅰ"
    },
    "20519": {
        "조현준": "이름",
        "C": "독서1",
        "D": "수학Ⅱ-2",
        "E": "확률과통계1",
        "F": "영어Ⅱ-2",
        "A": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20520": {
        "홍석준": "이름",
        "A": "독서2",
        "C": "고전읽기",
        "D": "수학Ⅱ-2",
        "F": "영어Ⅱ-2",
        "B": "지구과학Ⅰ",
        "E": "윤리와 사상"
    },
    "20601": {
        "강경훈": "이름",
        "D": "독서1",
        "C": "고전읽기",
        "A": "수학Ⅱ-1",
        "E": "영어Ⅱ-2",
        "B": "지구과학Ⅰ",
        "F": "정치와법"
    },
    "20602": {
        "강동협": "이름",
        "B": "독서2",
        "D": "수학Ⅱ-1",
        "A": "확률과통계1",
        "F": "영어Ⅱ-2",
        "C": "물리학Ⅰ",
        "E": "화학Ⅱ"
    },
    "20603": {
        "구민회": "이름",
        "A": "독서2",
        "D": "수학Ⅱ-1",
        "C": "확률과통계1",
        "E": "영어Ⅱ-2",
        "B": "화학Ⅰ",
        "F": "정보과학"
    },
    "20604": {
        "권민석": "이름",
        "C": "독서2",
        "E": "수학Ⅱ-2",
        "D": "확률과통계1",
        "F": "영어Ⅱ-2",
        "B": "화학Ⅰ",
        "A": "생명과학Ⅰ"
    },
    "20605": {
        "김대영": "이름",
        "F": "독서2",
        "C": "고전읽기",
        "E": "수학Ⅱ-1",
        "B": "영어Ⅱ-1",
        "A": "생명과학Ⅰ",
        "D": "생활과 윤리"
    },
    "20606": {
        "김현우": "이름",
        "D": "독서1",
        "E": "수학Ⅱ-2",
        "F": "확률과통계1",
        "C": "영어Ⅱ-1",
        "B": "화학Ⅰ",
        "A": "생명과학Ⅰ"
    },
    "20607": {
        "서지호": "이름",
        "D": "독서1",
        "B": "수학Ⅱ-2",
        "F": "확률과통계1",
        "A": "영어Ⅱ-2",
        "C": "물리학Ⅰ",
        "E": "화학Ⅱ"
    },
    "20608": {
        "안종훈": "이름",
        "A": "독서2",
        "C": "수학Ⅱ-2",
        "D": "영어Ⅱ-1",
        "F": "영미문학읽기",
        "B": "경제",
        "E": "세계사"
    },
    "20609": {
        "윤재현": "이름",
        "C": "독서2",
        "F": "수학Ⅱ-1",
        "B": "확률과통계1",
        "D": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "A": "화학Ⅰ"
    },
    "20610": {
        "이상원": "이름",
        "D": "독서1",
        "A": "수학Ⅱ-1",
        "B": "영어Ⅱ-1",
        "F": "영미문학읽기",
        "C": "지구과학Ⅰ",
        "E": "세계사"
    },
    "20611": {
        "이성철": "이름",
        "F": "독서2",
        "C": "수학Ⅱ-2",
        "A": "확률과통계2",
        "D": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "B": "화학Ⅰ"
    },
    "20612": {
        "임범진": "이름",
        "B": "독서1",
        "C": "수학Ⅱ-2",
        "E": "영어Ⅱ-2",
        "F": "영미문학읽기",
        "A": "생명과학Ⅰ",
        "D": "생활과 윤리"
    },
    "20613": {
        "장민석": "이름",
        "F": "독서2",
        "D": "수학Ⅱ-1",
        "C": "확률과통계1",
        "A": "영어Ⅱ-1",
        "E": "화학Ⅰ",
        "B": "지구과학Ⅰ"
    },
    "20614": {
        "전성호": "이름",
        "C": "독서2",
        "A": "수학Ⅱ-1",
        "D": "확률과통계1",
        "F": "영어Ⅱ-2",
        "E": "물리학Ⅱ",
        "B": "화학Ⅰ"
    },
    "20615": {
        "정원영": "이름",
        "F": "독서2",
        "C": "수학Ⅱ-2",
        "B": "확률과통계1",
        "D": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "A": "화학Ⅰ"
    },
    "20616": {
        "조승준": "이름",
        "B": "독서2",
        "E": "수학Ⅱ-2",
        "A": "확률과통계1",
        "D": "영어Ⅱ-1",
        "F": "화학Ⅰ",
        "C": "지구과학Ⅰ"
    },
    "20617": {
        "조정원": "이름",
        "C": "독서2",
        "B": "수학Ⅱ-2",
        "D": "확률과통계1",
        "A": "영어Ⅱ-2",
        "E": "물리학Ⅱ",
        "F": "화학Ⅰ"
    },
    "20618": {
        "조현우": "이름",
        "D": "독서1",
        "F": "수학Ⅱ-1",
        "C": "확률과통계1",
        "B": "영어Ⅱ-2",
        "E": "화학Ⅱ",
        "A": "생명과학Ⅰ"
    },
    "20619": {
        "홍기영": "이름",
        "A": "독서2",
        "C": "수학Ⅱ-2",
        "B": "확률과통계1",
        "F": "영어Ⅱ-2",
        "E": "사회문화",
        "D": "생활과 윤리"
    },
    "20701": {
        "강동옥": "이름",
        "E": "독서1",
        "F": "수학Ⅱ-1",
        "C": "확률과통계1",
        "A": "영어Ⅱ-1",
        "D": "물리학Ⅱ",
        "B": "지구과학Ⅰ"
    },
    "20702": {
        "강동완": "이름",
        "D": "독서1",
        "C": "수학Ⅱ-2",
        "F": "확률과통계1",
        "A": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "B": "화학Ⅰ"
    },
    "20703": {
        "곽준석": "이름",
        "B": "독서1",
        "A": "수학Ⅱ-1",
        "D": "영어Ⅱ-1",
        "F": "영미문학읽기",
        "C": "지구과학Ⅰ",
        "E": "세계사"
    },
    "20704": {
        "김동훈": "이름",
        "B": "독서1",
        "D": "수학Ⅱ-2",
        "A": "영어Ⅱ-1",
        "F": "영미문학읽기",
        "C": "지구과학Ⅰ",
        "E": "세계사"
    },
    "20705": {
        "김민준": "이름",
        "B": "독서2",
        "D": "수학Ⅱ-1",
        "A": "확률과통계1",
        "F": "영어Ⅱ-2",
        "C": "물리학Ⅰ",
        "E": "화학Ⅱ"
    },
    "20706": {
        "김선홍": "이름",
        "B": "독서1",
        "F": "수학Ⅱ-1",
        "C": "확률과통계1",
        "A": "영어Ⅱ-2",
        "D": "물리학Ⅱ",
        "E": "화학Ⅰ"
    },
    "20707": {
        "김영민": "이름",
        "D": "독서1",
        "C": "수학Ⅱ-2",
        "A": "영어Ⅱ-2",
        "F": "영미문학읽기",
        "B": "지구과학Ⅰ",
        "E": "세계사"
    },
    "20708": {
        "김영진": "이름",
        "E": "독서1",
        "F": "수학Ⅱ-1",
        "C": "확률과통계1",
        "A": "영어Ⅱ-1",
        "B": "경제",
        "D": "생활과 윤리"
    },
    "20709": {
        "김웅배": "이름",
        "C": "독서2",
        "E": "수학Ⅱ-2",
        "B": "영어Ⅱ-1",
        "F": "영미문학읽기",
        "A": "생명과학Ⅰ",
        "D": "생활과 윤리"
    },
    "20710": {
        "김준환": "이름",
        "D": "독서1",
        "C": "수학Ⅱ-2",
        "E": "확률과통계1",
        "A": "영어Ⅱ-2",
        "F": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20711": {
        "박선웅": "이름",
        "F": "독서2",
        "A": "수학Ⅱ-1",
        "C": "확률과통계1",
        "B": "영어Ⅱ-1",
        "E": "화학Ⅱ",
        "D": "생활과 윤리"
    },
    "20712": {
        "박용준": "이름",
        "F": "독서2",
        "D": "수학Ⅱ-1",
        "E": "확률과통계1",
        "A": "영어Ⅱ-2",
        "B": "생명과학Ⅱ",
        "C": "지구과학Ⅰ"
    },
    "20713": {
        "박유신": "이름",
        "B": "독서2",
        "C": "수학Ⅱ-2",
        "E": "확률과통계1",
        "A": "영어Ⅱ-1",
        "F": "정치와법",
        "D": "생활과 윤리"
    },
    "20714": {
        "송지훈": "이름",
        "C": "독서1",
        "F": "수학Ⅱ-1",
        "D": "확률과통계1",
        "A": "영어Ⅱ-2",
        "E": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20715": {
        "윤지훈": "이름",
        "C": "독서1",
        "E": "수학Ⅱ-2",
        "F": "확률과통계1",
        "A": "영어Ⅱ-2",
        "D": "물리학Ⅱ",
        "B": "화학Ⅰ"
    },
    "20716": {
        "이동건": "이름",
        "D": "독서1",
        "F": "수학Ⅱ-1",
        "B": "확률과통계1",
        "A": "영어Ⅱ-2",
        "C": "물리학Ⅰ",
        "E": "화학Ⅱ"
    },
    "20717": {
        "이상현": "이름",
        "F": "독서2",
        "E": "수학Ⅱ-2",
        "D": "확률과통계1",
        "A": "영어Ⅱ-2",
        "C": "물리학Ⅰ",
        "B": "지구과학Ⅰ"
    },
    "20718": {
        "전성현": "이름",
        "B": "독서2",
        "E": "수학Ⅱ-2",
        "A": "확률과통계1",
        "F": "영어Ⅱ-2",
        "C": "지구과학Ⅰ",
        "D": "한국지리"
    },
    "20719": {
        "최석헌": "이름",
        "B": "독서2",
        "F": "수학Ⅱ-1",
        "C": "확률과통계1",
        "A": "영어Ⅱ-1",
        "D": "물리학Ⅱ",
        "E": "화학Ⅰ"
    },
    "20720": {
        "현윤수": "이름",
        "C": "독서1",
        "A": "수학Ⅱ-1",
        "B": "확률과통계1",
        "D": "영어Ⅱ-1",
        "E": "화학Ⅰ",
        "F": "정보과학"
    },
    "20801": {
        "김대헌": "이름",
        "C": "독서1",
        "D": "수학Ⅱ-1",
        "B": "확률과통계1",
        "F": "영어Ⅱ-2",
        "E": "화학Ⅱ",
        "A": "생명과학Ⅰ"
    },
    "20802": {
        "김서원": "이름",
        "B": "독서2",
        "D": "수학Ⅱ-2",
        "F": "확률과통계1",
        "A": "영어Ⅱ-1",
        "C": "물리학Ⅰ",
        "E": "화학Ⅱ"
    },
    "20803": {
        "김신원": "이름",
        "B": "독서2",
        "D": "수학Ⅱ-1",
        "E": "확률과통계1",
        "C": "영어Ⅱ-1",
        "F": "화학Ⅰ",
        "A": "생명과학Ⅰ"
    },
    "20804": {
        "김은호": "이름",
        "C": "독서1",
        "A": "수학Ⅱ-1",
        "B": "확률과통계1",
        "D": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "F": "정보과학"
    },
    "20805": {
        "김정우": "이름",
        "D": "독서2",
        "C": "고전읽기",
        "B": "수학Ⅱ-2",
        "F": "영어Ⅱ-2",
        "A": "생명과학Ⅰ",
        "E": "사회문화"
    },
    "20806": {
        "김태현": "이름",
        "F": "독서2",
        "E": "수학Ⅱ-2",
        "D": "확률과통계1",
        "C": "영어Ⅱ-1",
        "B": "화학Ⅰ",
        "A": "생명과학Ⅰ"
    },
    "20807": {
        "박형기": "이름",
        "C": "독서1",
        "E": "수학Ⅱ-2",
        "F": "확률과통계1",
        "A": "영어Ⅱ-2",
        "D": "물리학Ⅱ",
        "B": "화학Ⅰ"
    },
    "20808": {
        "백경민": "이름",
        "A": "독서2",
        "D": "수학Ⅱ-2",
        "E": "확률과통계1",
        "C": "영어Ⅱ-1",
        "B": "화학Ⅰ",
        "F": "정보과학"
    },
    "20809": {
        "손예준": "이름",
        "E": "독서1",
        "C": "고전읽기",
        "F": "수학Ⅱ-1",
        "A": "영어Ⅱ-2",
        "B": "지구과학Ⅰ",
        "D": "생활과 윤리"
    },
    "20810": {
        "신동훈": "이름",
        "D": "독서1",
        "F": "수학Ⅱ-1",
        "C": "확률과통계1",
        "B": "영어Ⅱ-1",
        "E": "화학Ⅰ",
        "A": "생명과학Ⅰ"
    },
    "20811": {
        "염정운": "이름",
        "A": "독서2",
        "C": "고전읽기",
        "D": "수학Ⅱ-2",
        "F": "영어Ⅱ-2",
        "B": "지구과학Ⅰ",
        "E": "사회문화"
    },
    "20812": {
        "우지성": "이름",
        "B": "독서1",
        "F": "수학Ⅱ-1",
        "A": "확률과통계2",
        "D": "영어Ⅱ-1",
        "E": "화학Ⅰ",
        "C": "지구과학Ⅰ"
    },
    "20813": {
        "윤서범": "이름",
        "C": "독서2",
        "D": "수학Ⅱ-1",
        "A": "확률과통계1",
        "B": "영어Ⅱ-2",
        "E": "물리학Ⅱ",
        "F": "화학Ⅰ"
    },
    "20814": {
        "이용규": "이름",
        "C": "독서2",
        "E": "수학Ⅱ-1",
        "B": "확률과통계1",
        "F": "영어Ⅱ-2",
        "D": "물리학Ⅱ",
        "A": "화학Ⅰ"
    },
    "20815": {
        "이준혁": "이름",
        "B": "독서2",
        "E": "수학Ⅱ-1",
        "A": "확률과통계1",
        "C": "영어Ⅱ-1",
        "D": "물리학Ⅱ",
        "F": "화학Ⅰ"
    },
    "20816": {
        "이한별": "이름",
        "B": "독서1",
        "E": "수학Ⅱ-2",
        "A": "영어Ⅱ-2",
        "F": "영미문학읽기",
        "C": "지구과학Ⅰ",
        "D": "한국지리"
    },
    "20817": {
        "장준혁": "이름",
        "F": "독서2",
        "C": "수학Ⅱ-2",
        "E": "확률과통계1",
        "D": "영어Ⅱ-1",
        "A": "화학Ⅰ",
        "B": "생명과학Ⅱ"
    },
    "20818": {
        "정승민": "이름",
        "C": "독서1",
        "D": "수학Ⅱ-1",
        "F": "확률과통계1",
        "B": "영어Ⅱ-1",
        "E": "물리학Ⅱ",
        "A": "생명과학Ⅰ"
    },
    "20819": {
        "정승연": "이름",
        "F": "독서2",
        "D": "수학Ⅱ-2",
        "A": "확률과통계2",
        "E": "영어Ⅱ-2",
        "B": "화학Ⅰ",
        "C": "지구과학Ⅰ"
    },
    "20820": {
        "최규현": "이름",
        "B": "독서1",
        "E": "수학Ⅱ-2",
        "C": "영어Ⅱ-1",
        "F": "영미문학읽기",
        "A": "생명과학Ⅰ",
        "D": "생활과 윤리"
    }
}

const schedule = [['E','E','C','B','A'],['C','A*','A','B*','D*'],['B','C','C*','C','D'],['A','A','B*','E','F'],['D*','F','E','F','창'],['D','B','F','C*','창'],['A*','D','B','D','창']];
const health = {
	"1D": "운동1",
	"2D": "보건2",
	"1A": "보건1",
	"2A": "운동2",
	"1C": "보건1",
	"2C": "운동2",
	"1B": "운동1",
	"2B": "보건2",
}// 체육과 보건중 먼저나오는 세트

let number = localStorage.getItem("number") | "";
if(list4[number]){
	draw();
}
document.querySelector("form").addEventListener("submit",(el)=>{
	el.preventDefault();
	number = el.target.number.value;
	if(number.length == 4) number = number[0] + "0" + number[1] + number[2] + number[3];
	localStorage.setItem("number", number)
	draw();
})

function draw(){
	const set4 = document.querySelectorAll(".set4-tr td");
	const set2 = document.querySelectorAll(".set2-tr td");
	const subject2 = document.querySelectorAll(" .subject2-tr td");
	const subject4 = document.querySelectorAll(" .subject4-tr td");
	const teacher4 = document.querySelectorAll(".teacher4-tr td");
	const teacher2 = document.querySelectorAll(".teacher2-tr td");
	
	document.querySelector(".name").innerHTML = number;
	
	//4단위
	subject4.forEach((sub, index)=>{
		sub.innerHTML = list4[number][set4[index].innerText]
	})
	teacher4.forEach((tch, index)=>{
		const a = whoTeacher(subject4[index].innerText ,set4[index].innerText)
		tch.innerHTML = '<span>'+a+'</span>' + "<br/>" + where[a];
	})
	//2단위
	subject2.forEach((sub, index)=>{
		if(list2[number][set2[index].innerText])
		sub.innerHTML = list2[number][set2[index].innerText]
	})
	teacher2.forEach((tch, index)=>{
		
		if(list2[number][set2[index].innerText])
		tch.innerHTML = '<span>'+whoTeacher(subject2[index].innerText ,set2[index].innerText)+'</span>' + "<br/>" + where[whoTeacher(subject2[index].innerText ,set2[index].innerText)];
	})
	
	
	const scheTr = document.querySelectorAll("#own-schedule tr");
	let now =  new Date();
	let day = now.getDay();
	let healthCnt=0;
	scheTr.forEach((tr,i)=>{
		if(i!=0){
			const td = tr.querySelectorAll("td");
			td.forEach((td, j)=>{
				if(j!=0){
					let a = schedule[i-1][j-1];
				if(a.length == 1){
					if(list4[number][a])	{
						const div = document.createElement("div")
						div.innerHTML = list4[number][a]+"<br/>"+"("+whoTeacher(list4[number][a],a)+"T)";
						div.title = "위치: "+where[whoTeacher(list4[number][a],a)];
						td.innerText="";
						td.append(div);
						td.classList.add(a);
						if(day == j)
							td.classList.add("today");
					}

				}
				if(a.length == 2){
					a=a.replace("*","")
					if(list2[number][a][1] =="건"){
							let subH;
							if(healthCnt++ == 0)
								subH = health[list2[number][a][list2[number][a].length-1]+a];
							else{
								subH = list2[number][a].replace("&","").replace(health[list2[number][a][list2[number][a].length-1]+a],"");
							}
						const div = document.createElement("div")
						div.innerHTML = subH+"<br/>"+"("+whoTeacher(subH,a)+"T)";
						div.title = "위치: "+where[whoTeacher(subH,a)];
						td.innerText="";
						td.append(div);
							if(day == j)
								td.classList.add("today");
						}
						else if(list2[number][a])	{
							td.innerHTML = list2[number][a]+"<br/>"+"("+whoTeacher(list2[number][a],a)+"T)";
							td.title = "위치: "+where[whoTeacher(list2[number][a],a)];
							if(day == j)
								td.classList.add("today");
						}
					td.classList.add(a+a);
					}
				}
			})
		}
	})
}

function whoTeacher(sub, set){
	if(teacher[sub]) return teacher[sub];
	if(teacher[sub+set]) return teacher[sub+set];
	console.log("errrrrorrrrr", sub, set);
	return undefined;
}

//Object.keys(list4).forEach(key=>{
	//number = key;
	//draw();
//})
